Repository: SIXiaolong1117/NetworkSelector
Catalog: NetworkSelector/Language/*/Resources.resw
Source language: en_us
Languages: zh_cn

# AboutAliPay.Content
source: Alipay
zh_cn: 支付宝

# AboutAuthor.Text
source: 👾Author:
zh_cn: 👾作者:

# AboutHeader.Text
source: About
zh_cn: 关于

# AboutHelp.Text
source: ❓Help:
zh_cn: ❓帮助:

# AboutLicense.Text
source: ⚖️Open Source License:
zh_cn: ⚖️开源许可:

# AboutPrivacy.Text
source: 🔑Privacy Policy:
zh_cn: 🔑隐私策略:

# AboutSponsor.Text
source: ☕Sponsor
zh_cn: ☕赞助

# AboutSponsorTips.Text
source: Enter the name to be displayed, in reverse chronological order
zh_cn: 备注要展示的名称

# AboutVersion.Text
source: 🍰Version:
zh_cn: 🍰版本号:

# AboutWePay.Content
source: WeChat
zh_cn: 微信

# AddConfConfigName.Header
source: Configuration Name:
zh_cn: 配置名称:

# AddConfConfigName.PlaceholderText
source: eg: Bypass Gateway
zh_cn: eg: 旁路网关

# AddConfDns1.Header
source: IPv4 Preferred DNS:
zh_cn: IPv4 首选 DNS:

# AddConfDns2.Header
source: IPv4 Alternate DNS:
zh_cn: IPv4 备选 DNS:

# AddConfGateway.Header
source: Gateway:
zh_cn: 网关:

# AddConfigHeader.Text
source: Add a Configuration
zh_cn: 添加一个配置

# AddConfIpAddr.Header
source: IP Address
zh_cn: IP 地址

# AddConfNetworkInterfaceName.Header
source: Interface:
zh_cn: 接口:

# AddConfNetworkInterfaceName.PlaceholderText
source: Select a network interface
zh_cn: 选择一个网口

# AddConfSubnetMask.Header
source: Subnet Mask:
zh_cn: 子网掩码:

# AppTitle
source: Gateway Switcher
zh_cn: 网关切换器

# AppTitleTextBlock.Text
source: Gateway Switcher
zh_cn: 网关切换器

# backgroundMaterial.Header
source: Background Material:
zh_cn: 背景材料：

source: Cancel
zh_cn: 取消

# ConfigGrid.Text
source: Configuration
zh_cn: 配置

source: Confirm
zh_cn: 确认

# ConfirmDelete.Text
source: Are you sure you want to delete?
zh_cn: 确定要删除吗？

# ConfirmReplace.Text
source: Are you sure you want to overwrite?
zh_cn: 确定要覆盖吗？

# copyMenuItemText
source: Copy Configuration
zh_cn: 复制配置

# deleteMenuItemText
source: Delete Configuration
zh_cn: 删除配置

# DialogAdd
source: Add
zh_cn: 添加

# DialogChange
source: Change
zh_cn: 修改

# DialogClose
source: Close
zh_cn: 关闭

source: Disable IPv6
zh_cn: 禁用IPv6

# editMenuItemText
source: Edit Configuration
zh_cn: 编辑配置

source: Enable IPv6
zh_cn: 启用IPv6

# exportMenuItemText
source: Export Configuration
zh_cn: 导出配置

# Interface.Header
source: Interface:
zh_cn: 接口:

# Interface.PlaceholderText
source: Select your current internet access interface
zh_cn: 选择您当前的上网网口

# IPv4Unconnect
source: IPv4 not connected
zh_cn: 未找到 IPv4 连接

# IPv6Unconnect
source: IPv6 not connected
zh_cn: 未找到 IPv6 连接

# IsAdminButTips.ActionButtonContent
source: Revert to regular user privileges
zh_cn: 退回普通用户权限

# IsAdminButTips.Subtitle
source: WinUI cannot perform import and export operations under administrator privileges. Please run as a regular user.
zh_cn: WinUI 无法在管理员权限下进行导入导出操作，请您以普通用户身份启动。

# IsAdminButTips.Title
source: Operation Failed!
zh_cn: 操作失败！

# NavViewItemAbout.Content
source: About
zh_cn: 关于

# NavViewItemNetSetting.Content
source: Gateway Switch
zh_cn: 网关切换

# NeedSelectedTips.Title
source: You need to select a configuration
zh_cn: 需要选中一个配置

# NetInterfaceGrid.Text
source: Interface
zh_cn: 接口

# NetSelectHeader.Text
source: Gateway Switch
zh_cn: 网关切换

# NetworkInterfaceDescription.Text
source: Interface Description:
zh_cn: 接口描述:

# NetworkInterfaceGatewayAddress.Text
source: Gateway Address:
zh_cn: 网关地址:

# NetworkInterfaceIPAddress.Text
source: IP Address:
zh_cn: IP 地址:

# NetworkInterfaceMACAddress.Text
source: Physical Address (MAC):
zh_cn: 物理地址 (MAC) 地址:

# NetworkInterfaceName.Text
source: Interface Name:
zh_cn: 接口名称:

# NetworkInterfaceSpeed.Text
source: Negotiated Speed:
zh_cn: 协商速度:

# NetworkInterfaceSubnetMask.Text
source: Subnet Mask:
zh_cn: 子网掩码:

# NetworkInterfaceTypeTextBox.Text
source: Interface Type:
zh_cn: 接口类型:

# NetworkIsChangeTips.Subtitle
source: The network configuration has been changed via command line. You may need to re-enter the "Windows Advanced Network Settings" page to see the changes.
zh_cn: 已经通过命令行命令修改了网络配置，您可能需要重新进入 “Windows 高级网络设置” 页面才能看到修改结果。

# NetworkIsChangeTips.Title
source: Network Preset Switched
zh_cn: 网络预设已经切换

# NotAdminTips.ActionButtonContent
source: Grant Administrator Privileges
zh_cn: 给予管理员权限

# NotAdminTips.Subtitle
source: You need to run Gateway Selector with administrator privileges because command line commands require administrator access to modify network configuration.
zh_cn: 您需要以管理员身份运行网关切换器 (Gateway Selector)，这是因为命令行命令需要在管理员权限下才可以修改网络配置信息。

# NotAdminTips.Title
source: Operation Failed!
zh_cn: 操作失败！

# refreshItemText
source: Refresh
zh_cn: 刷新

# replaceMenuItemText
source: Replace Configuration
zh_cn: 覆盖配置

# SelectInterface.Text
source: Select your internet access interface
zh_cn: 选择您的上网网口

# selectMenuItemText
source: Switch to this configuration
zh_cn: 切换至此配置

# SettingsHeader.Text
source: Settings
zh_cn: 设置

# Sponsor.Text
source: Sponsor Me:
zh_cn: 赞助我：

# Tips1.Text
source: Double-click to apply configuration, right-click for configuration menu
zh_cn: 双击左键应用配置 右键配置打开菜单

# Tips2.Text
source: Current Internet Access Interface Information
zh_cn: 当前上网网口信息

# TypeEthernet
source: Ethernet
zh_cn: 以太网

# TypeLoopback
source: Loopback
zh_cn: 回环

# TypeTunnel
source: Tunnel
zh_cn: 隧道

# TypeUnknown
source: Unknown
zh_cn: 未知

# TypeWireless80211
source: Wireless (IEEE 802.11)
zh_cn: 无线 (IEEE 802.11)
